If you enclose the variable in parentheses it works:

```hcl
module "route53_zones" {
  source  = "terraform-aws-modules/route53/aws//modules/zones"
  version = "1.2.0"

  zones = {
    (var.domain_name) = {
      comment = "Managed by Terraform"

      tags = local.tags
    }
  }
}
```

```shell
  ...
  # module.route53_zones.aws_route53_zone.this["domain.tld"] will be created
  + resource "aws_route53_zone" "this" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "domain.tld"
      + name_servers  = (known after apply)
      + tags          = {
          + "Application" = "domain.tld"
          + "Environment" = "sandbox"
          + "Terraform"   = "true"
        }
      + zone_id       = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```